{
  "Укажите отличительные особенности технологии БД, выделяющие ее среди технологий вообще и информационных технологий, в частности.": "База данных -- это технология, регламентирующая процесс создания и эксплуатации информационных систем, в которых для долговременного хранения информации используется база данных, а управляет ею некоторая система управления базами данных (СУБД).",
  "Каковы предпосылки использования технологии БД?": "1) Необходимость в долговременном хранении информации; 2) Необходимость обеспечения взаимодействия нескольких пользователей; 3) Нужно хорошо структурированное и непротиворечивое хранилище; 4) Необходимость вносить изменения; 5) Необходимость в простом и удобном извлечении информации; 6) Производная информация должна получаться из первичной без разработки спец. алгоритмов; 7) Хранение информации в алфавитно-цифровой форме.",
  "В чем особенности термина «модель» в технологии БД?": "«Модель» в технологии БД -- теория моделирования, а сама БД -- результат моделирования. В других отраслях знаний моделью называют результат.",
  "Каково основное назначение моделей данных?": "Основное назначение МД -- обеспечение процесса интерпретации (осмысления) данных и превращения их в информацию.",
  "Перечислите составные части любой модели данных.": "Для этого в каждой модели данных имеются следующие компоненты: правила порождения допустимых структур данных; правила порождения ограничений целостности данных; набор операций над данными.",
  "Каково назначение структур данных, ограничений целостности и операций над данными?": "На основании правил определяется схема БД (основные понятия предметной области и их взаимосвязи), а операции необходимы, чтобы первоначально наполнить схему непротиворечивыми данными и поддерживать их в дальнейшем в адекватном предметной информации. Правила структуризации определяют БД как совокупность отношений (таблиц). Каждое отношение соответствует одному типу объектов (смысл их представляется именем отношения) и задает одинаковый для всех объектов этого типа набор атрибутов (столбцов). В схеме отношения для каждого атрибута определено его имя, представленное в таблице в заголовке столбца. Таким образом, структуру отношения может олицетворять поименованная шапка пустой таблицы. Ограничения целостности связаны с поддержанием БД в целостном, непротиворечивом состоянии, максимально соответствующем состоянию моделируемой предметной области.",
  "Укажите основные процессы в системах БД, кто и какие задачи в них реализует.": "К необязательным, но часто важным процессам создания информационных систем (ИС) по этой технологии относятся процессы разработки специализированного программного обеспечения (ПО), реализующего специфическую для предметной области (ПрО) бизнес-логику. Проектирование схемы БД - Проектировщик БД - исследует ПрО и реализует ее семантическую схему. Администрирование БД - Администратор БД - устанавливает БД на оборудование и администрирует ее (физическая схема БД). Использование БД - Пользователь БД - 'пишет' или 'читает' необходимую информацию (это основной процесс, ибо ради этого БД создается и поддерживается).",
  "Для чего предназначены CASE-системы?": "Осуществить ввод семантической схемы, а, во-вторых, автоматически перевести ее на язык СУБД без потери информации. Каждый элемент семантической схемы должен найти свое отражение в логической модели СУБД (в крайнем случае -- в процедурной форме).",
  "Перечислите и кратко охарактеризуйте архитектуры систем БД.": "В однопользовательской архитектуре вся система БД управляется одним компьютером, на котором расположены и БД, и СУБД, и диалоговая система пользователя. Клиент-сервер (двухуровневая) - обработка БД на сервере, диалог с пользователем происходит через компьютер (клиент). В трехуровневой архитектуре, используемой в интернет-приложениях, есть сервер БД, web-сервер и браузер. Между web-сервером и браузером передаются web-страницы и данные, а между web-сервером и сервером БД - SQL-операторы и реляционные данные.",
  "В чем основные различия OLTP -систем БД и хранилищ данных? Что такое OLAP-системы?": "OLTP-системы (Online Transaction Processing) предназначены для оперативной обработки большого потока транзакций с внесением незначительных изменений в данные. Хранилища данных предназначены для хранения информации и ее анализа. Основное отличие: OLTP-системы позволяют редактировать, удалять, добавлять и обновлять данные в реальном времени, тогда как хранилища просто хранят информацию для просмотра. OLAP-инструменты (Online Analytical Processing) — это средства оперативной аналитической обработки, которые позволяют работать с многомерными хранилищами данных (кубами данных) для сложного анализа, используя техники 'drag and drop' и 'drill-down/drill-up'.",
  "Какие формы представлений о ПрО выделяют в технологии БД? Охарактеризуйте каждую из них.": "1) Представление в голове человека (на основании личного знакомства с ПрО). 2) Семантическая схема (формальное представление). 3) СУБД-ориентированная (схема на диалекте конкретной СУБД). 4) Логическая (обращена к человеку, предоставляет языки общения). 5) Физическая (обращена к средствам хранения данных).",
  "Объясните, почему человека интересуют не данные, а информация.": "Сами по себе данные ничего не говорят человеку. Информация — это приращение знаний, полученное на основе данных. Данные представлены в формализованном виде, а информация — в доступной для усвоения человеком форме.",
  "Что кроме данных необходимо для получения информации?": "Необходимы интерпретации (единицы измерения, контекст) и знания человека. Интерпретация дает представление о смысле данных, а знания позволяют получить дополнительную информацию на этапе прагматического анализа.",
  "К какому классу информационных систем относятся системы БД с точки зрения принципов получения информации?": "К классу систем, где интерпретации хранятся на диске в виде специальным образом организованных (структурированных) данных. Заданные однократно интерпретации ассоциируются с данными при их вводе и сохраняют связь при всех манипуляциях, обеспечивая получение информации.",
  "Перечислите и охарактеризуйте три этапа процесса образования информации из данных.": "1) Синтаксический анализ (анализ знаков с точки зрения синтаксиса). 2) Семантический анализ (получение информации через интерпретацию данных). 3) Прагматический анализ (получение дополнительной информации на основе имеющихся у 'читателя' знаний).",
  "Какие разделы семиотики изучают эти этапы?": "Синтактика изучает внутренние свойства систем знаков. Семантика рассматривает отношение знаков к обозначаемому (содержание знаков). Прагматика изучает восприятие знаков и их полезность для интерпретатора.",
  "Опишите, как протекает процесс передачи информации о ПрО с использованием систем БД.": "I этап: Проектировщик формализует ситуацию, определяя знаки для объектов и связей. II этап: Обращение к знаковой системе (создание новых объектов и связей). III этап: Читатель воссоздает представление, обращаясь к системе.",
  "В чем заключается основное назначение модели данных?": "Модель данных (МД) обеспечивает процесс интерпретации данных и превращает их в информацию.",
  "Из каких компонентов состоит атомарная единица информации (АЕИ)?": "Она определяется четверкой: <Идентификатор объекта, Наименование признака, Значение признака, [Время]>. Каждый АЕИ задает истинность факта: «объект имеет определенное значение признака в конкретное время».",
  "Объясните, почему первые три компонента АЕИ являются обязательными.": "Без любого из первых трех компонентов (идентификатор объекта, наименование признака, значение признака) информация не может быть сформирована. Время является необязательным компонентом.",
  "Синтезируйте категориальную модель.": "Категориальная модель предполагает разбиение всех объектов предметной области по категориям. Для каждой категории определяется набор признаков. Если несколько таблиц описывают объекты одной категории, модель предполагает их объединение в одну общую таблицу.",
  "Дайте структурное определение модели данных.": "Модель данных определяется двумя множествами: 1) Множество правил порождения схем (включая правила для структур данных и ограничений целостности). 2) Множество операций над данными.",
  "Проиллюстрируйте компоненты модели данных на примере категориальной модели.": "Структуры данных: БД — это совокупность таблиц (категорий), где каждая строка — объект, а столбец — признак. Ограничения целостности: правила для данных, например, указание типа (число, строка), перечисление допустимых значений. Операции над данными: INSERT (добавление), UPDATE (изменение), DELETE (удаление), SELECT (поиск).",
  "С чем ассоциируются понятия «схема БД» и «база данных» при табличном представлении данных?": "Схема БД ассоциируется с совокупностью именованных категорий, их признаков и ограничений на данные (структура). База данных (БД) ассоциируется с совокупностью данных (содержимым таблиц), которые соответствуют конкретной схеме.",
  "Что представляет собой СУБД? Какие классы операций необходимо реализовать в любой СУБД?": "СУБД (система управления базами данных) — это программные средства для управления БД. В любой СУБД должны быть реализованы операции определения данных (ЯОД - язык определения данных) и манипулирования данными (ЯМД - язык манипулирования данными).",
  "Что представляют собой элементарные единицы данных и интерпретаций. Для чего они используются в технологии БД?": "Знак — это данное (строка, число), определяющее объект, связь или значение. Тип — это именованный класс подобных знаков, имя которого определяет их интерпретацию. Они используются для структуризации и осмысления данных в БД.",
  "В каких частях системы БД представлены элементарные единицы данных и интерпретаций?": "В структурном компоненте схемы БД, который представляет собой взаимосвязанную систему определений типов (типов объектов, их связей и характеристик).",
  "Какие мыслительные процедуры используются при структуризации данных? Уточните, когда применяется каждая из них.": "Классификация (обобщение знаков до типа, отношение «экземпляр-класс»), генерализация (обобщение типов до супертипа, «подкласс-суперкласс»), агрегация (конструирование объекта из базовых, отношение «часть-целое»).",
  "Поясните, как абстракция используется для интерпретации данных?": "Абстракция используется для придания семантики (смысла) множествам объектов. Когда в предметной области обнаруживается объект, подпадающий под некоторое понятие, строится его абстрактное представление с определением значений его признаков.",
  "Перечислите традиционно используемые в моделях данных формы данных.": "Комплекс, множество, кортеж, домен, атрибут, отношение.",
  "Укажите свойства множеств": "- Могут быть бесконечными; - На элементах отсутствует порядок; - Элементы-дубликаты не имеют смысла.",
  "Дайте определения интенсионала и экстенсионала множества. Почему в моделировании данных уместно говорить о нескольких реализациях множества?": "Интенсионал — это свойства, общие для всех элементов множества (условие принадлежности). Экстенсионал — это актуальная реализация множества путем явного перечисления его элементов. В динамичных предметных областях одному и тому же множеству (интенсионалу) в разное время могут соответствовать разные реализации (экстенсионалы).",
  "Чем отличается комплекс от множества?": "В отличие от множества, в комплексе элементы распределены по позициям. В каждой позиции может быть любое число элементов, а в разных позициях могут быть одинаковые элементы. Множество — это комплекс, где все элементы находятся в одной позиции.",
  "Покажите, что понятия «множество» и «кортеж» являются специализациями понятия «комплекс».": "Множество — это комплекс, все элементы которого находятся в одной позиции. Кортеж (n-местный) — это комплекс, который имеет по одному элементу в каждой позиции от 1 до n.",
  "В чем принципиальное отличие элементов, принадлежащих домену и атрибуту?": "Домен — это множество синтаксически однородных элементов (например, целые числа). Атрибут — это именованный домен, представляющий семантически значимые объекты и их характеристики. Атрибут придает домену смысл в контексте предметной области.",
  "Дайте определения и уточните различия определений понятия «отношение» в математике, логике и моделировании данных.": "В математике отношение — это подмножество декартова произведения множеств (множество упорядоченных пар). В логике — это отображение на множество {истина, ложь}. В моделировании данных отношение — это структура, состоящая из заголовка (имена атрибутов) и тела (множество кортежей), и хранит только истинные факты, в отличие от логического. В отличие от математического, порядок атрибутов в кортеже не важен.",
  "В каком виде задаются в БД интерпретации данных?": "В виде таблиц, графов или их комбинации. В таблицах заголовок и столбцы задают интерпретацию. В графах интерпретацию несут именованные вершины и ребра.",
  "Каким формам данных приписываются интерпретации?": "Атрибутам и отношениям.",
  "Как они используются для интерпретации знаков (данных)?": "Используя атрибуты, происходит интерпретация абстрактных понятий, таких как числа и строки. Например, число '180' в атрибуте 'Рост' интерпретируется как рост 180 см. Объект представляется в виде кортежа значений его характеристик (атрибутов).",
  "Установите соответствие между формами данных и их представлениями в виде таблиц и графов.": "Табличное представление: Отношение -> Таблица, Тип объектов -> Таблица, Атрибут -> Столбец, Кортеж -> Строка. Графовое представление: Тип объектов/атрибут -> Именованная вершина, Связь -> Именованное ребро, Экземпляр объекта/значения -> Вершина графа знаков.",
  "Что ассоциируется с понятиями «интенсионал БД» и «экстенсионал БД»?": "Интенсионал БД — это схема БД (структуры и ограничения целостности). Экстенсионал БД — это текущая реализация БД, то есть конкретные данные, хранящиеся в ней в данный момент.",
  "Что такое ограничение целостности (ОЦ) и для чего они предназначены?": "Ограничение целостности (ОЦ) — это логическое условие, которое должно быть истинным для любого состояния БД. Они предназначены для поддержания адекватности и непротиворечивости данных в базе, отражая законы реального мира.",
  "Дайте определения понятий, связанных с процессом верификации ОЦ.": "Состояние БД удовлетворяет схеме, если оно удовлетворяет всем ее ограничениям. Схема удовлетворяема, если существует хотя бы одно состояние БД, удовлетворяющее ей. Схема противоречива, если такого состояния не существует.",
  "Охарактеризуйте способы проверки ОЦ с точки зрения их предпочтительности.": "Внутренние (неявные) — определяются самими формами данных и не требуют деклараций (предпочтительны, но имеют узкий диапазон). Явные — реализуются на языке описания ограничений; СУБД проверяет их непротиворечивость и обеспечивает контроль.",
  "Какие типы ОЦ выделяются в моделировании данных? Каковы их области действия?": "1. Ограничения на значения атрибутов (область действия — отдельные атрибуты или несколько атрибутов одного отношения). 2. Ограничения на отображения (между атрибутами одного отношения или между разными отношениями).",
  "Перечислите виды ОЦ на значения атрибутов.": "Ограничение на NULL-значения (NOT NULL), проверка уникальности (UNIQUE), проверка по списку значений (IN), проверка по диапазону (BETWEEN), проверка по шаблону (LIKE), проверка по условию (CHECK).",
  "В чем особенность традиционного определения понятия «отображение» в математике?": "Особенность заключается в требовании обязательного наличия единственного образа для каждого аргумента (за исключением многозначных функций).",
  "Укажите основные отличия «математического отображения» от «семантически значимого отображения»": "Семантически значимое отображение определяет закон предметной области и может меняться со временем (экземпляры могут появляться и исчезать). Математическое отображение абстрактно, его образы и прообразы не меняются.",
  "Дайте определения, характеризующие роли элементов множеств, участвующих в отображении.": "Образ объекта x — объект y, поставленный в соответствие объекту x. Прообраз объекта y — объект x, которому соответствует y. Область определения отображения (ООО) — совокупность объектов, которые могут иметь образ. Область значений отображения (ОЗО) — совокупность объектов, которые могут быть образами.",
  "Почему в моделировании данных приходится рассматривать реальные и потенциальные ООО и ОЗО? Дайте им определения.": "Семантика отображений стабильна, но их экземпляры динамичны. Поэтому рассматривают реальные (текущие) и потенциальные (все возможные) области. Реальная область определения/значений (РООО/РОЗО) — совокупность всех текущих объектов, имеющих образы/являющихся образами. Потенциальная область (ООО/ОЗО) — совокупность всех объектов, которые могли/могут иметь образы или быть образами в прошлом, настоящем или будущем.",
  "Дайте определения КЧ, МинКЧ и МаксКЧ. К каким элементам относятся эти характеристики?": "Кардинальное число (КЧ) — мощность области образов объекта при отображении. МинКЧ (Минимальное кардинальное число) и МаксКЧ (Максимальное кардинальное число) — это минимальное и максимальное количество образов, которые может иметь любой объект из области определения отображения. Эти характеристики относятся к отображению в целом.",
  "Перечислите и укажите характеристики типов отображений.": "1. Полное/Частичное (МинКЧ=1/МинКЧ=0). 2. Функциональное/Нефункциональное (МаксКЧ=1/МаксКЧ>1). 3. Инъективное (каждый образ имеет не более одного прообраза). 4. Сюръективное (каждый элемент ОЗО является образом). 5. Биективное (инъективное + сюръективное).",
  "Поясните фразу «бинарное отношение множеств определяет два отображения между ними».": "Любое бинарное отношение R между множествами S1 и S2 определяет два отображения: одно из S1 в S2, а другое (обратное) из S2 в S1. В зависимости от функциональности этих отображений, отношение классифицируется как 1:1, 1:M, или M:N.",
  "Какими символическими нотациями можно описать бинарные отношения? Сравните их информативность на примере различных типов бинарных отношений.": "Первая нотация (например, R(S1(0, ∞) : S2(0, 1))) является исчерпывающей, так как характеризует и МинКЧ, и МаксКЧ для обоих отображений. Вторая нотация (1:1, 1:M, M:N) менее информативна, так как характеризует только МаксКЧ.",
  "Укажите отличие сложного отображения от простого отображения. Приведите примеры сложных отображений, укажите их характеристики и тип.": "Простое отображение: каждый экземпляр имеет один объект-прообраз и один объект-образ (бинарные отношения). Сложное отображение: экземпляр имеет более одного прообраза и/или образа (тернарные и более высокой арности отношения). Пример сложного: отношение 'ОТЕЦ-МАТЬ-РЕБЕНОК' между тремя объектами типа ЧЕЛОВЕК.",
  "Дайте три определения возможного ключа.": "1. Атрибут (или группа), который функционально определяет все другие атрибуты отношения. 2. Атрибут (или группа), который уникально идентифицирует кортежи отношения. 3. Атрибут (или группа), который не имеет значений-дубликатов в кортежах отношения.",
  "Что означает «определенность значения атрибута»?": "Это означает, что в каждом кортеже отношения для данного атрибута должно быть указано какое-то значение (атрибут не может быть NULL).",
  "Какие особенности каких отображений скрываются в определении возможного ключа и обязательности значений атрибута?": "В определении возможного ключа скрыто, что отображение между ключом и отношением является функциональным. В обязательности значений атрибута скрыто, что отображение между отношением и этим атрибутом является полным.",
  "Дайте определение «расширенного» состояния БД.": "Это состояние, включающее не только реализацию данных, но и управляющие элементы (например, сообщения об ошибках). Перевод БД из одного состояния в другое происходит при изменении либо данных, либо управляющих элементов.",
  "Что такое операция над данными?": "Это процесс перевода БД из одного состояния в другое (или в неопределенное состояние), который не должен приводить к нарушению целостности, определенной в схеме БД.",
  "Какие два компонента можно выделить в любой операции над данными?": "1. Действие (что сделать: вставить, обновить, удалить, выбрать). 2. Селекция (критерий отбора данных, над которыми производится действие).",
  "Какие действия над данными предусмотрены в технологии БД?": "1. Установка текущих (SET CURRENCY, FIND). 2. Включение/добавление (INSERT, ADD). 3. Обновление (UPDATE, MODIFY). 4. Удаление (DELETE, REMOVE). 5. Выборка (SELECT, GET).",
  "Какими способами можно селектировать данные для выполнения тех или иных действий с ними?": "1. По логической позиции в БД (селекция по текущей). 2. По значениям данных (селекция по данным). 3. По связям между данными (селекция по связям).",
  "Какие два класса операций и языков манипулирования данными выделяются в технологии БД? Каковы их особенности?": "1. Навигационные: результат — единственный элемент, полученный при 'прохождении' по структуре БД. Запросы представляют собой программу. 2. Спецификационные (например, SQL): результат — множество элементов, соответствующее новой подсхеме. Запросы декларативны, а не процедурны.",
  "Что такое процедура БД?": "Это последовательность операций, выполняемых при определенных условиях. Специфицируются в схеме и состоят из разделов: условия, действия, уведомления.",
  "Какие виды процедур БД вам известны?": "1. Функции агрегирования (SUM, COUNT). 2. Виртуальный атрибут (вычисляемое значение). 3. Триггеры целостности. 4. Триггеры безопасности. 5. Операторы доступа (расширение языка). 6. Прикладные триггеры (запускаемые INSERT, UPDATE, DELETE). 7. Системные триггеры (для администрирования).",
  "Различия между процедурами БД и операциями.": "Операции являются базовыми действиями (INSERT, SELECT и т.д.), в то время как процедуры представляют собой более сложную логику, состоящую из последовательности операций, которые выполняются при наступлении определенных событий или условий."
}
